nxp-mcuxpresso/mcux-soc-svd/MCXN247T/MCXN247T.xml
        <register>
          <name>DMA_MODE</name>
          <description>DMA Bus Mode</description>
          <addressOffset>0x1000</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SWR</name>
              <description>Software Reset</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Software Reset is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Software Reset is enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DA</name>
              <description>DMA Tx or Rx Arbitration Scheme</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WRR</name>
                  <description>Weighted Round-Robin with Rx:Tx or Tx:Rx</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FP</name>
                  <description>Fixed Priority</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TAA</name>
              <description>Transmit Arbitration Algorithm</description>
              <bitOffset>2</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FP</name>
                  <description>Fixed priority</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WSP</name>
                  <description>Weighted Strict Priority (WSP)</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WRR</name>
                  <description>Weighted Round-Robin (WRR)</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TXPR</name>
              <description>Transmit Priority</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Transmit Priority is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Transmit Priority is enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PR</name>
              <description>Priority Ratio</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>R_1_1</name>
                  <description>The priority ratio is 1:1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>R_2_1</name>
                  <description>The priority ratio is 2:1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>R_3_1</name>
                  <description>The priority ratio is 3:1</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>R_4_1</name>
                  <description>The priority ratio is 4:1</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>R_5_1</name>
                  <description>The priority ratio is 5:1</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>R_6_1</name>
                  <description>The priority ratio is 6:1</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>R_7_1</name>
                  <description>The priority ratio is 7:1</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>R_8_1</name>
                  <description>The priority ratio is 8:1</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA_SYSBUS_MODE</name>
          <description>DMA System Bus Mode</description>
          <addressOffset>0x1004</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FB</name>
              <description>Fixed Burst Length</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Fixed Burst Length is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Fixed Burst Length is enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AAL</name>
              <description>Address-Aligned Beats</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Address-Aligned Beats is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Address-Aligned Beats is enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MB</name>
              <description>Mixed Burst</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Mixed Burst is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Mixed Burst is enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RB</name>
              <description>Rebuild INCRx Burst</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Rebuild INCRx Burst is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Rebuild INCRx Burst is enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA_INTERRUPT_STATUS</name>
          <description>DMA Interrupt Status</description>
          <addressOffset>0x1008</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DC0IS</name>
              <description>DMA Channel 0 Interrupt Status</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INACTIVE</name>
                  <description>DMA Channel 0 Interrupt Status not detected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACTIVE</name>
                  <description>DMA Channel 0 Interrupt Status detected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DC1IS</name>
              <description>DMA Channel 1 Interrupt Status</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INACTIVE</name>
                  <description>DMA Channel 1 Interrupt Status not detected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACTIVE</name>
                  <description>DMA Channel 1 Interrupt Status detected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MTLIS</name>
              <description>MTL Interrupt Status</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INACTIVE</name>
                  <description>MTL Interrupt Status not detected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACTIVE</name>
                  <description>MTL Interrupt Status detected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MACIS</name>
              <description>MAC Interrupt Status</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INACTIVE</name>
                  <description>MAC Interrupt Status not detected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACTIVE</name>
                  <description>MAC Interrupt Status detected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA_DEBUG_STATUS0</name>
          <description>DMA Debug Status 0</description>
          <addressOffset>0x100C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>AXWHSTS</name>
              <description>AHB Master Status</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INACTIVE</name>
                  <description>AXI Master Write Channel or AHB Master Status not detected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACTIVE</name>
                  <description>AXI Master Write Channel or AHB Master Status detected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RPS0</name>
              <description>DMA Channel 0 Receive Process State</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>STOP</name>
                  <description>Stopped (Reset or Stop Receive Command issued)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RUN_FRTD</name>
                  <description>Running (Fetching Rx Transfer Descriptor)</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RUN_WRP</name>
                  <description>Running (Waiting for Rx packet)</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SUSPND</name>
                  <description>Suspended (Rx Descriptor Unavailable)</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RUN_CRD</name>
                  <description>Running (Closing the Rx Descriptor)</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TSTMP</name>
                  <description>Timestamp write state</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RUN_TRP</name>
                  <description>Running (Transferring the received packet data from the Rx buffer to the system memory)</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TPS0</name>
              <description>DMA Channel 0 Transmit Process State</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>STOP</name>
                  <description>Stopped (Reset or Stop Transmit Command issued)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RUN_FTTD</name>
                  <description>Running (Fetching Tx Transfer Descriptor)</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RUN_WS</name>
                  <description>Running (Waiting for status)</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RUN_RDS</name>
                  <description>Running (Reading Data from system memory buffer and queuing it to the Tx buffer (Tx FIFO))</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TSTMP_WS</name>
                  <description>Timestamp write state</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SUSPND</name>
                  <description>Suspended (Tx Descriptor Unavailable or Tx Buffer Underflow)</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RUN_CTD</name>
                  <description>Running (Closing Tx Descriptor)</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RPS1</name>
              <description>DMA Channel 1 Receive Process State</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>STOP</name>
                  <description>Stopped (Reset or Stop Receive Command issued)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RUN_FRTD</name>
                  <description>Running (Fetching Rx Transfer Descriptor)</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RUN_WRP</name>
                  <description>Running (Waiting for Rx packet)</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SUSPND</name>
                  <description>Suspended (Rx Descriptor Unavailable)</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RUN_CRD</name>
                  <description>Running (Closing the Rx Descriptor)</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TSTMP</name>
                  <description>Timestamp write state</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RUN_TRP</name>
                  <description>Running (Transferring the received packet data from the Rx buffer to the system memory)</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TPS1</name>
              <description>DMA Channel 1 Transmit Process State</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>STOP</name>
                  <description>Stopped (Reset or Stop Transmit Command issued)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RUN_FTTD</name>
                  <description>Running (Fetching Tx Transfer Descriptor)</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RUN_WS</name>
                  <description>Running (Waiting for status)</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RUN_RDS</name>
                  <description>Running (Reading Data from system memory buffer and queuing it to the Tx buffer (Tx FIFO))</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TSTMP_WS</name>
                  <description>Timestamp write state</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SUSPND</name>
                  <description>Suspended (Tx Descriptor Unavailable or Tx Buffer Underflow)</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RUN_CTD</name>
                  <description>Running (Closing Tx Descriptor)</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA_CH0_CONTROL</name>
          <description>DMA Channel 0 Control</description>
          <addressOffset>0x1100</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PBLx8</name>
              <description>8xPBL mode</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>8xPBL mode is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>8xPBL mode is enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DSL</name>
              <description>Descriptor Skip Length</description>
              <bitOffset>18</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
